/*
 *mixApp.app.js
 *app模块
 *子应用模型
 *负责提供子应用功能
 */
mixApp.app = (function (){
  //======模块作用域变量配置=========
  var 
    appMap = {},

    //方法
    //=================
    registApp;
  //===模块作用域变量配置区域结束====

  //=========子应用管理方法==========
    
  //=====子应用管理方法区域结束======

  //=========事件处理方法============
  //=====事件处理方法区域结束========

  //===========公共方法==============
  
  //注册子应用
  //==========
  registApp = function (app){
      appMap[app.name] = app;
      
    };

  return {registApp: registApp, appMap:appMap};
  //=======公共方法区域结束==========
})();
